# SpatialElementGeometryCalculator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementGeometryCalculator Methods
SpatialElementGeometryCalculator Class See Also
---
The SpatialElementGeometryCalculator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CalculateSpatialElementGeometry | Compute the spatial element geometry and returns the boundary face information. |
| CanCalculateGeometry | This indicates whether the input spatial element is a valid one. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetOptions | The options that control the calculation. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsRoomOrSpace | This indicates whether the input spatial element is a room or a space. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace